// Основы ООП: класс. экземпляр (объект), интерфейс

// Функции-конструкторы
// - Именование
// - Оператор new
// - Свойство Function.prototype

// 1. Если функция вызывается через new, создаётся пустой объект
// 2. Функция вызывается в контексте созданного объекта,
//    тo есть в this записывается ссылка на него
// 3. В свойство this._proto_ записывается ссылка на обьект Car.prototype
//    тоесть Car.prototype это ПРОТОТИП будущего обьекта (экземпляра)
// 4. Ссылка на обьект возвращается в место вызова new Car

// brand: "Audi"
// model: 'Q3'
// price: 35000

// brand: "Audi"
// name: 'A6'
// price: 65000

// brand: 'BMW'
// name: 'X6'
// price: 50000

// Статистические свойства и методы
